In [43]:
import numpy as np
import pandas as pd

In [44]:
df = pd.read_csv('south_china_sea1.1.csv')
df.head(10)

        year  TOPEX/Poseidon  Jason-1  Jason-2  Jason-3
0  1992.9609           -5.59      NaN      NaN      NaN
1  1992.9859          -16.89      NaN      NaN      NaN
2  1993.0108          -18.49      NaN      NaN      NaN
3  1993.0382            7.01      NaN      NaN      NaN
4  1993.0654           11.31      NaN      NaN      NaN
5  1993.0967          -18.69      NaN      NaN      NaN
6  1993.1197          -73.89      NaN      NaN      NaN
7  1993.1472          -71.59      NaN      NaN      NaN
8  1993.1759          -30.89      NaN      NaN      NaN
9  1993.2029          -67.89      NaN      NaN      NaN

In [45]:
df.info() #finding short info about data set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1308 entries, 0 to 1307
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            1308 non-null   float64
 1   TOPEX/Poseidon  439 non-null    float64
 2   Jason-1         411 non-null    float64
 3   Jason-2         301 non-null    float64
 4   Jason-3         173 non-null    float64
dtypes: float64(5)
memory usage: 51.2 KB

In [46]:
df.isnull() #fiding missing value

       year  TOPEX/Poseidon  Jason-1  Jason-2  Jason-3
0     False           False     True     True     True
1     False           False     True     True     True
2     False           False     True     True     True
3     False           False     True     True     True
4     False           False     True     True     True
...     ...             ...      ...      ...      ...
1303  False            True     True     True    False
1304  False            True     True     True    False
1305  False            True     True     True    False
1306  False            True     True     True    False
1307  False            True     True     True    False

[1308 rows x 5 columns]

In [47]:
df.isnull().sum() #fiding missing values summary

year                 0
TOPEX/Poseidon     869
Jason-1            897
Jason-2           1007
Jason-3           1135
dtype: int64

In [48]:
df.eq(0).sum() #analyzing how many zeros on the data set

year              0
TOPEX/Poseidon    0
Jason-1           0
Jason-2           0
Jason-3           0
dtype: int64

In [49]:
df.shape

(1308, 5)

In [50]:
df.head()

        year  TOPEX/Poseidon  Jason-1  Jason-2  Jason-3
0  1992.9609           -5.59      NaN      NaN      NaN
1  1992.9859          -16.89      NaN      NaN      NaN
2  1993.0108          -18.49      NaN      NaN      NaN
3  1993.0382            7.01      NaN      NaN      NaN
4  1993.0654           11.31      NaN      NaN      NaN

In [55]:
df.fillna(method='bfill'), inplace=True)
df.head()

SyntaxError: cannot assign to function call (Temp/ipykernel_9544/1143469146.py, line 1)